web/pages/c_calls.org
#+DATE:      27 January 2009
what's in a call?

consider the following piece of code:

#+BEGIN_SRC c
int sum(int x, int y){
  int result = x+y;
  return result;
}
int main(){
  return sum(1,2);
}
#+END_SRC

as c programmers, we expect the =main= routine to call =sum=.  however, the
compiler has a lot of details to sort out before generating the machine
instructions to realize this: how should the arguments be passed, how will
the result be returned, etc. to address these implementation details, the
compiler adheres to certain conventions. this note attempts to uncover the
conventions used by the compiler i have at hand (visual studio c/c++
compiler). for a similar discussion with gcc on x86-linux - see this [[http://www.cs.umbc.edu/~chang/cs313.s02/stack.shtml][page]].
* getting started
we start by building the simple program shown above and loading the
executable in a debugger for stepwise execution (the =/INCREMENTAL:NO=
linker option disables the use of incremental link tables which complicate
function calls and are irrelevant to our current discussion, anyway.)

#+BEGIN_EXAMPLE
c:\>cl /nologo /c /Zi test.c
c:\>link /nologo /INCREMENTAL:NO /DEBUG test.obj
c:\>cdb test.exe
0:000> uf main
00401020 55              push    ebp
00401021 8bec            mov     ebp,esp
00401023 6a02            push    2
00401025 6a01            push    1
00401027 e8d4ffffff      call    test!sum (00401000)
0040102c 83c408          add     esp,8
0040102f 5d              pop     ebp
00401030 c3              ret
0:000> uf sum
test!sum:
00401000 55              push    ebp
00401001 8bec            mov     ebp,esp
00401003 51              push    ecx
00401004 8b4508          mov     eax,dword ptr [ebp+8]
00401007 03450c          add     eax,dword ptr [ebp+0Ch]
0040100a 8945fc          mov     dword ptr [ebp-4],eax
0040100d 8b45fc          mov     eax,dword ptr [ebp-4]
00401010 8be5            mov     esp,ebp
00401012 5d              pop     ebp
00401013 c3              ret
#+END_EXAMPLE

the unassembled output shows the machine instructions generated for the two
routines we're looking into.  the actual instructions depends on the
compiler and the target machine (which, in my case are cl 14.00.50727.42
and 80x86.) note that both routines start (with - =push ebp= & =mov
ebp,esp=) and end similarly (with - =pop ebp= & =ret=).  these similar
/prologue/ and /epilogue/ are independent of the function's business logic
and manage its /stack frame/. on x86, the stack frame is made up of the
memory between the addresses in the =ebp= (stack bottom pointer) and the
=esp= (stack top pointer). as we'll see later, all memory locations
relevant to the function's execution are referenced in relation to this
frame.

so then, without further ado, let's start the program and break at the
point where main gets started with its calling business, i.e. at address
=00401023=.

* the caller
the caller prepares for the call by pushing the arguments it wishes to pass
onto the stack.  the two instructions following our break point in =main=
do just that:

#+BEGIN_EXAMPLE
0:000> bp 00401023
0:000> g
Breakpoint 0 hit
test!main+0x3:
00401023 6a02            push    2
0:000> r esp,ebp
esp=0012ff70 ebp=0012ff70
0:000> p
test!main+0x5:
00401025 6a01            push    1
0:000> p
test!main+0x7:
00401027 e8d4ffffff      call    test!sum (00401000)
0:000> r esp,ebp
esp=0012ff68 ebp=0012ff70
0:000> dds esp ebp
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
#+END_EXAMPLE

notice that the arguments are pushed in the reverse order of
declaration. on x86 the =push= instruction decrements the =esp= by an
offset (equal to the bytes needed to hold the value we're pushing) and
stores the value starting at the new address in the =esp=. since we've
pushed two integers the =esp= is reduced by 8 and the stack frame (i.e.
the memory between the addresses in ebp and =esp=) now contains the two
arguments we've just pushed (in addition to whatever it had earlier.)

* the call
the next instruction is the actual call to the sum routine. on x86 the
=call= instruction saves the instruction pointer on the stack and jumps to
the label passed as the argument, which, in our case is =test!sum=.

#+BEGIN_EXAMPLE
0:000> u eip l2
test!main+0x7:
00401027 e8d4ffffff      call    test!sum (00401000)
0040102c 83c408          add     esp,8
0:000> t
test!sum:
00401000 55              push    ebp
0:000> r esp,ebp
esp=0012ff64 ebp=0012ff70
0:000> dds esp ebp
0012ff64  0040102c test!main+0xc
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
#+END_EXAMPLE

the debugger output confirms what we knew about =call= - the esp is reduced
by 4 and the top of the stack contains the address of the instruction just
after the =call= in main. note that the =eip= now contains the instruction
of the first instruction in =sum= - which means we've entered our callee.

the caller's stack-frame at this point of time looks as:

#+BEGIN_EXAMPLE
   +----------+----------+
esp| 0012ff64 | 0040102c | return location in main
   +----------+----------+
   | 0012ff68 | 00000001 | argument #1
   +----------+----------+
   | 0012ff6c | 00000002 | argument #2
   +----------+----------+
ebp| 0012ff70 | 0012ffc0 | main's caller's ebp
   +----------+----------+
     address    content
#+END_EXAMPLE
