web/html/c_calls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>what's in a call?</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="27 January 2009"/>
<meta name="author" content="aldrin j d'souza"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">what's in a call?</h1>

<p>consider the following piece of code:
</p>



<pre class="src src-c"><span style="color: #cdcd00; font-size: 105%;">int</span> <span style="color: #0087ff; font-size: 105%; font-weight: bold;">sum</span>(<span style="color: #cdcd00; font-size: 105%;">int</span> <span style="color: #ffd700;">x</span>, <span style="color: #cdcd00; font-size: 105%;">int</span> <span style="color: #ffd700;">y</span>){
  <span style="color: #cdcd00; font-size: 105%;">int</span> <span style="color: #ffd700;">result</span> = x+y;
  <span style="color: #ffafaf; font-size: 105%;">return</span> result;
}
<span style="color: #cdcd00; font-size: 105%;">int</span> <span style="color: #0087ff; font-size: 105%; font-weight: bold;">main</span>(){
  <span style="color: #ffafaf; font-size: 105%;">return</span> sum(1,2);
}
</pre>




<p>
as c programmers, we expect the <code>main</code> routine to call <code>sum</code>.  however, the
compiler has a lot of details to sort out before generating the machine
instructions to realize this: how should the arguments be passed, how will
the result be returned, etc. to address these implementation details, the
compiler adheres to certain conventions. this note attempts to uncover the
conventions used by the compiler i have at hand (visual studio c/c++
compiler). for a similar discussion with gcc on x86-linux - see this <a href="http://www.cs.umbc.edu/~chang/cs313.s02/stack.shtml">page</a>.
</p>
<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">getting started </h2>
<div class="outline-text-2" id="text-1">

<p>we start by building the simple program shown above and loading the
executable in a debugger for stepwise execution (the <code>/INCREMENTAL:NO</code>
linker option disables the use of incremental link tables which complicate
function calls and are irrelevant to our current discussion, anyway.)
</p>



<pre class="example">c:\&gt;cl /nologo /c /Zi test.c
c:\&gt;link /nologo /INCREMENTAL:NO /DEBUG test.obj
c:\&gt;cdb test.exe
0:000&gt; uf main
00401020 55              push    ebp
00401021 8bec            mov     ebp,esp
00401023 6a02            push    2
00401025 6a01            push    1
00401027 e8d4ffffff      call    test!sum (00401000)
0040102c 83c408          add     esp,8
0040102f 5d              pop     ebp
00401030 c3              ret
0:000&gt; uf sum
test!sum:
00401000 55              push    ebp
00401001 8bec            mov     ebp,esp
00401003 51              push    ecx
00401004 8b4508          mov     eax,dword ptr [ebp+8]
00401007 03450c          add     eax,dword ptr [ebp+0Ch]
0040100a 8945fc          mov     dword ptr [ebp-4],eax
0040100d 8b45fc          mov     eax,dword ptr [ebp-4]
00401010 8be5            mov     esp,ebp
00401012 5d              pop     ebp
00401013 c3              ret
</pre>



<p>
the unassembled output shows the machine instructions generated for the two
routines we're looking into.  the actual instructions depends on the
compiler and the target machine (which, in my case are cl 14.00.50727.42
and 80x86.) note that both routines start (with - <code>push ebp</code> &amp; <code>mov ebp,esp</code>) and end similarly (with - <code>pop ebp</code> &amp; <code>ret</code>).  these similar
<i>prologue</i> and <i>epilogue</i> are independent of the function's business logic
and manage its <i>stack frame</i>. on x86, the stack frame is made up of the
memory between the addresses in the <code>ebp</code> (stack bottom pointer) and the
<code>esp</code> (stack top pointer). as we'll see later, all memory locations
relevant to the function's execution are referenced in relation to this
frame.
</p>
<p>
so then, without further ado, let's start the program and break at the
point where main gets started with its calling business, i.e. at address
<code>00401023</code>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">the caller </h2>
<div class="outline-text-2" id="text-2">

<p>the caller prepares for the call by pushing the arguments it wishes to pass
onto the stack.  the two instructions following our break point in <code>main</code>
do just that:
</p>



<pre class="example">0:000&gt; bp 00401023
0:000&gt; g
Breakpoint 0 hit
test!main+0x3:
00401023 6a02            push    2
0:000&gt; r esp,ebp
esp=0012ff70 ebp=0012ff70
0:000&gt; p
test!main+0x5:
00401025 6a01            push    1
0:000&gt; p
test!main+0x7:
00401027 e8d4ffffff      call    test!sum (00401000)
0:000&gt; r esp,ebp
esp=0012ff68 ebp=0012ff70
0:000&gt; dds esp ebp
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
</pre>



<p>
notice that the arguments are pushed in the reverse order of
declaration. on x86 the <code>push</code> instruction decrements the <code>esp</code> by an
offset (equal to the bytes needed to hold the value we're pushing) and
stores the value starting at the new address in the <code>esp</code>. since we've
pushed two integers the <code>esp</code> is reduced by 8 and the stack frame (i.e.
the memory between the addresses in ebp and <code>esp</code>) now contains the two
arguments we've just pushed (in addition to whatever it had earlier.)
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">the call </h2>
<div class="outline-text-2" id="text-3">

<p>the next instruction is the actual call to the sum routine. on x86 the
<code>call</code> instruction saves the instruction pointer on the stack and jumps to
the label passed as the argument, which, in our case is <code>test!sum</code>.
</p>



<pre class="example">0:000&gt; u eip l2
test!main+0x7:
00401027 e8d4ffffff      call    test!sum (00401000)
0040102c 83c408          add     esp,8
0:000&gt; t
test!sum:
00401000 55              push    ebp
0:000&gt; r esp,ebp
esp=0012ff64 ebp=0012ff70
0:000&gt; dds esp ebp
0012ff64  0040102c test!main+0xc
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
</pre>



<p>
the debugger output confirms what we knew about <code>call</code> - the esp is reduced
by 4 and the top of the stack contains the address of the instruction just
after the <code>call</code> in main. note that the <code>eip</code> now contains the instruction
of the first instruction in <code>sum</code> - which means we've entered our callee.
</p>
<p>
the caller's stack-frame at this point of time looks as:
</p>



<pre class="example">   +----------+----------+
esp| 0012ff64 | 0040102c | return location in main
   +----------+----------+
   | 0012ff68 | 00000001 | argument #1
   +----------+----------+
   | 0012ff6c | 00000002 | argument #2
   +----------+----------+
ebp| 0012ff70 | 0012ffc0 | main's caller's ebp
   +----------+----------+
     address    content
</pre>


</div>

</div>
