web/html/c_calls.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">the callee </h2>
<div class="outline-text-2" id="text-4">

<p>one of the <i>calling conventions</i> the compiler follows ensures that value of
the <code>ebp</code> register is preserved during a call. in other words, after the
callee finishes, the ebp register is restored to the value it held before
the callee execution started. this is achieved by the prologue and the
epilogue we identified earlier. the convention actually extends to the
values in <code>esi</code>, <code>edi</code> and <code>ebx</code> registers too. however, since our <code>sum</code>
routine does not use any of those registers there is no need to preserve
their values.  
</p>
<p>
let's start tracing the callee execution:
</p>



<pre class="example">0:000&gt; u eip l1
test!sum:
00401000 55              push    ebp
0:000&gt; p
test!sum+0x1:
00401001 8bec            mov     ebp,esp
0:000&gt; p
test!sum+0x3:
00401003 51              push    ecx
0:000&gt; dds esp ebp
0012ff60  0012ff70
0:000&gt; p
test!sum+0x4:
00401004 8b4508          mov     eax,dword ptr [ebp+8] ss:0023:0012ff68=00000001
0:000&gt; dds esp ebp
0012ff5c  00000001
0012ff60  0012ff70
</pre>



<p>
the first instruction pushes the existing <code>ebp</code> value to the stack and the
next moves the <code>esp</code> value into the <code>ebp</code> register. effectively the two
setup a fresh stack frame for the sum routine, very much like the main's
stack frame when we started tracing the program. the next instruction is a
bit tricky - we didn't keep anything in <code>ecx</code>, so why <code>push ecx</code>?  why is
the compiler pushing an irrelevant value on the stack?
</p>
<p>
actually what the compiler wants to achieve is to allocate space for the
local variable <code>result</code>. typically, it allocates space by subtracting the
combined size of all the locals from the esp, but here it sees scope for an
optimization. all that this routine needs is 4 bytes of local storage for
the integer variable and esp can be appropriately decremented by pushing a
dummy register.  <code>sub 4 esp</code> would need more space and time to achieve the
same effect.
</p>
<p>
so now the stack frame looks as:
</p>



<pre class="example">                 +----------+----------+                                                      
[ebp-4]       esp| 0012ff5c | ???????? | local #1 = result (uninitialized)
                 +----------+----------+                                                      
              ebp| 0012ff60 | 0012ff70 | main's ebp                                           
                 +----------+----------+                                                      
                 | 0012ff64 | 0040102c | return address in main                               
                 +----------+----------+                                                      
[epb+8]          | 0012ff68 | 00000001 | argument #1 = x                                      
                 +----------+----------+                                                      
[ebp+12]         | 0012ff6c | 00000002 | argument #2 = y                                      
                 +----------+----------+                                                      
[old ebp]        | 0012ff70 | 0012ffc0 | main's caller's ebp                                  
                 +----------+----------+                                                      
                   address    contents                                                        
</pre>




</div>

<div id="outline-container-4-1" class="outline-4">
<h4 id="sec-4-1">the computation </h4>
<div class="outline-text-4" id="text-4-1">

<p>the next few instructions implement the business logic of the
routine. they're expected to add the two parameters and store the result in
the local variable. to refer to these variables and parameters, the
compiler uses another calling convention. the convention ensures that local
variables are stored at negative offsets from the ebp while the parameters
are at positive ones. for example: the address of the first and the second
parameters is <code>ebp+8</code> and <code>ebp+12</code> respectively.  similarly, the local
variable <code>result</code> is situated at <code>ebp-4</code>. the next three instructions use
these addresses to compute the sum of the two parameters and move it to the
local variable result.
</p>



<pre class="example">test!sum+0x4:
00401004 8b4508          mov     eax,dword ptr [ebp+8] ss:0023:0012ff68=00000001
0:000&gt;p
test!sum+0x7:
00401007 03450c          add     eax,dword ptr [ebp+0Ch] ss:0023:0012ff6c=00000002
0:000&gt;p
test!sum+0xa:
0040100a 8945fc          mov     dword ptr [ebp-4],eax ss:0023:0012ff5c=00000001
</pre>



<p>
the  next instruction  is  responsible  for ensuring  the  result value  is
returned back to main.
</p>



<pre class="example">0:000&gt; p
test!sum+0xd:
0040100d 8b45fc          mov     eax,dword ptr [ebp-4] ss:0023:0012ff5c=00000003
</pre>



<p>
the compiler convention assumes that the caller will look for the result in
the eax register. consequently, return values that are upto 32 bits wide
are returned directly in the eax register (as is the case, in our code). if
the computed result is larger than 32 bits, it is returned by reference
with eax containing a pointer to the result.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-4">
<h4 id="sec-4-2">the return </h4>
<div class="outline-text-4" id="text-4-2">


<p>
with the computation done, its time for the callee to return, but before
that happens, we need to deallocate the locals and restore the the ebp to
its original value. the epilog achieves this quite succintly in just two
instructions. the first sets esp to ebp thus reclaiming the space used by
the locals and the second resets ebp to the value on the top of the stack
(which is the caller's ebp)
</p>



<pre class="example">test!sum+0x10:
00401010 8be5            mov     esp,ebp
0:000&gt; p
test!sum+0x12:
00401012 5d              pop     ebp
0:000&gt; dds esp  ebp
0012ff60  0012ff70
0:000&gt; p
test!sum+0x13:
00401013 c3              ret
0:000&gt; dds esp  ebp
0012ff64  0040102c test!main+0xc
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
</pre>



<p>
notice that at the end of the two instructions the stack has been restored
to as it was just before we started the execution of sum. the final
instruction in sum <code>ret</code> pops the return address pushed by <code>call</code> and jumps
to the address, thus returning the control back to the caller.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">the cleanup </h2>
<div class="outline-text-2" id="text-5">

<p>following <code>ret</code> the control returns back to the main where there's not much
left to do. it only has to return the result obtained from <code>sum</code> and since
the result is already in eax there's nothing to be done. the stack,
however, still contains the call arguments on it, which need to be
deallocated.
</p>



<pre class="example">test!main+0xc:
0040102c 83c408          add     esp,8
0:000&gt; dds esp ebp
0012ff68  00000001
0012ff6c  00000002
0012ff70  0012ffc0
0:000&gt; p
test!main+0xf:
0040102f 5d              pop     ebp
0:000&gt; dds esp ebp
0012ff70  0012ffc0
</pre>



<p>
the argument memory is reclaimed by just adjusting the esp.  once that's
done returns to the state it was when we started tracing main.  the
remaining epilog is the same as in sum. here, the control returns to the
runtime routine which had invoked main.
</p>

</div>
