web/pages/c_calls.org
** microsoft specific calling conventions

   for stack cleanup the microsoft compiler provides the programmer with a
   bunch of [[http://msdn.microsoft.com/en-us/library/984x0h58(VS.71).aspx][options]]. for example, the programmer can choose to make the
   callee responsibile for cleaning up the arguments (instead of the
   caller, as is the case with our code). the idea is to reduce code size
   by localizing the clean-up code at one place, instead of scattering and
   repeating it in all places where the call is made. for a frequently used
   routine in large program this might save some code space.

   there are some interesting writeups on this matter - see [[http://www.unixwiz.net/techtips/win32-callconv.html][this]] and
   [[http://blogs.msdn.com/oldnewthing/archive/2004/01/15/58973.aspx][this]]. however i see little use of these proprietary options in code that
   i usually write. they're good things to be aware of though, especially
   in case we run into some stack corruption problems due to mismatches in
   these conventions.

* summary
here are the steps for review:
- the caller pushes the function arguments in the reverse order of
  declaration.
- the caller makes the actual call.
- the callee saves and updates the =ebp=.
- the callee allocates the local variables by adjusting the =esp=.
- the callee saves the CPU registers it wants to modify.
- the callee refers to the parameters giving positive offsets from its =ebp=.
- the callee refers to its local variables by giving negative offsets from its =ebp=.
- the callee stores the return value of the computation (or a pointer to
  it) in the eax.
- the callee deallocates the space used by local variables, by popping
  them off the stack. 
- the callee restores the caller's values of the registers it had saved.
- the callee restores the caller's =ebp= value.
- the callee returns.
- the caller cleans up the space used by the function arguments.

the  last  step  is  what  distinguishes the  =__cdecl=  (default)  calling
convention from the =__stdcall= convention. in the latter the clean-up code
is in the callee.

