web/html/c_calls.html

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">microsoft specific calling conventions </h3>
<div class="outline-text-3" id="text-5-1">


<p>
   for stack cleanup the microsoft compiler provides the programmer with a
   bunch of <a href="http://msdn.microsoft.com/en-us/library/984x0h58(VS.71).aspx">options</a>. for example, the programmer can choose to make the
   callee responsibile for cleaning up the arguments (instead of the
   caller, as is the case with our code). the idea is to reduce code size
   by localizing the clean-up code at one place, instead of scattering and
   repeating it in all places where the call is made. for a frequently used
   routine in large program this might save some code space.
</p>
<p>
   there are some interesting writeups on this matter - see <a href="http://www.unixwiz.net/techtips/win32-callconv.html">this</a> and
   <a href="http://blogs.msdn.com/oldnewthing/archive/2004/01/15/58973.aspx">this</a>. however i see little use of these proprietary options in code that
   i usually write. they're good things to be aware of though, especially
   in case we run into some stack corruption problems due to mismatches in
   these conventions.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">summary </h2>
<div class="outline-text-2" id="text-6">

<p>here are the steps for review:
</p><ul>
<li>the caller pushes the function arguments in the reverse order of
  declaration.
</li>
<li>the caller makes the actual call.
</li>
<li>the callee saves and updates the <code>ebp</code>.
</li>
<li>the callee allocates the local variables by adjusting the <code>esp</code>.
</li>
<li>the callee saves the CPU registers it wants to modify.
</li>
<li>the callee refers to the parameters giving positive offsets from its <code>ebp</code>.
</li>
<li>the callee refers to its local variables by giving negative offsets from its <code>ebp</code>.
</li>
<li>the callee stores the return value of the computation (or a pointer to
  it) in the eax.
</li>
<li>the callee deallocates the space used by local variables, by popping
  them off the stack. 
</li>
<li>the callee restores the caller's values of the registers it had saved.
</li>
<li>the callee restores the caller's <code>ebp</code> value.
</li>
<li>the callee returns.
</li>
<li>the caller cleans up the space used by the function arguments.
</li>
</ul>


<p>
the  last  step  is  what  distinguishes the  <code>__cdecl</code>  (default)  calling
convention from the <code>__stdcall</code> convention. in the latter the clean-up code
is in the callee.
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 27 January 2009</p>
<p class="author">Author: aldrin j d'souza</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
